---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.BoundaryAreaRestraintZ
source: html/c3831909-a3c6-86ab-0806-421f79e333e0.htm
---
# Autodesk.Revit.DB.ParameterTypeId.BoundaryAreaRestraintZ Property

"Z Spring Modulus"

## Syntax (C#)
```csharp
public static ForgeTypeId BoundaryAreaRestraintZ { get; }
```